gpu/rapidcfd/cases/vg08d50b10_a17/0/k
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0488412;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.0488412;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.0488412;
        value           uniform 0.0488412;
    }

    top
    {
        type            freestream;
        freestreamValue uniform 0.0488412;
    }

    bottom
    {
        type            freestream;
        freestreamValue uniform 0.0488412;
    }

    sideL
    {
        type            cyclicAMI;
    }

    sideR
    {
        type            cyclicAMI;
    }

    wing
    {
        type            kqRWallFunction;
        value           uniform 0.0488412;
    }

}
